tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "railwayapp/tap"
tap "rbenv/tap"
tap "stripe/stripe-cli"
brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "atuin"
brew "bat"
brew "bat-extras"
brew "cocoapods"
brew "node"
brew "corepack"
brew "curl"
brew "folly"
brew "edencommon"
brew "wxwidgets"
brew "erlang"
brew "eza"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "git"
brew "go"
brew "grep"
brew "gum"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "jsonpp"
brew "krb5"
brew "lazygit"
brew "make"
brew "mongosh"
brew "neofetch"
brew "neovim"
brew "oha"
brew "onefetch"
brew "openjdk"
brew "openvpn"
brew "php"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "smartmontools"
brew "starship"
brew "tldr"
brew "watchman"
brew "wget"
brew "yt-dlp"
brew "zig"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "railwayapp/tap/nixpacks"
brew "stripe/stripe-cli/stripe"
cask "alfred"
cask "android-platform-tools"
cask "android-studio"
cask "blender"
cask "brave-browser"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "fig"
cask "firefox"
cask "flameshot"
cask "flutter"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "libreoffice"
cask "maccy"
cask "macs-fan-control"
cask "mic-drop"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mongodb-compass"
cask "neo4j"
cask "ngrok"
cask "numi"
cask "ollama"
cask "openvpn-connect"
cask "opera-gx"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "redisinsight"
cask "slack"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "teamviewer"
cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
cask "vscodium"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "alexisvt.flutter-snippets"
vscode "amodio.tsl-problem-matcher"
vscode "artdiniz.quitcontrol-vscode"
vscode "bhoomitganatra.template-generators"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hollowtree.vue-snippets"
vscode "jock.svg"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "peterj.proto"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robertz.code-snapshot"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
