tap "albertlauncher/albert", trusted: true
tap "algorandfoundation/tap"
tap "anomalyco/tap"
tap "asmvik/formulae"
tap "codecrafters-io/tap"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "localstack/tap"
tap "macos-fuse-t/cask"
tap "mhaeuser/mhaeuser"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "railwayapp/tap"
tap "rbenv/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "supersonic-app/supersonic"
tap "zirixcz/vesktop"
# Run your GitHub Actions locally
brew "act"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Network authentication protocol
brew "krb5"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# .NET Core
brew "dotnet"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Programming language for highly scalable real-time systems
brew "erlang"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Improved top (interactive process viewer)
brew "htop"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line JSON pretty-printer
brew "jsonpp"
# Run local Kubernetes cluster in Docker
brew "kind"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Next-gen compiler infrastructure
brew "llvm@17"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Optimized BLAS library
brew "openblas"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk@17"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Terminal User Interface (TUI) to view & control docker containers
brew "oxker"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher", restart_service: :changed
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# General purpose fuzzy finder TUI
brew "television"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Plugin-based keyboard launcher
cask "albertlauncher/albert/albert", trusted: true
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Agent orchestration platform
cask "antigravity"
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Screenshot software with built-in annotation tools
cask "flameshot"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Kext-less implementation of FUSE
cask "fuse-t"
# SSHFS implementation based on FUSE-T
cask "macos-fuse-t/cask/fuse-t-sshfs"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Clipboard manager
cask "maccy"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application
cask "numi"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# A lightweight and full-featured cross-platform desktop client for self-hosted music servers
cask "supersonic-app/supersonic/supersonic"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "1yib.rust-bundle"
vscode "alexcvzz.vscode-sqlite"
vscode "artdiniz.quitcontrol-vscode"
vscode "bhoomitganatra.template-generators"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "circlecodesolution.ccs-flutter-color"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "icrawl.discord-vscode"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
go "github.com/air-verse/air"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/cespare/reflex"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/eliaonceagain/suptext"
go "github.com/LuD1161/upi-recon-cli"
cargo "rust-bitcoin-cpu-miner"
cargo "weathr"
npm "chrome-webstore-upload-cli"
npm "eas-cli"
npm "node-gyp"
npm "nodemon"
npm "pm2"
npm "pnpm"
npm "yarn"
