tap "algorandfoundation/tap"
tap "codecrafters-io/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "railwayapp/tap"
tap "rbenv/tap"
tap "stripe/stripe-cli"
brew "xz"
brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "atuin"
brew "awscli-local"
brew "bat"
brew "bat-extras"
brew "cocoapods"
brew "node"
brew "corepack"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "wxwidgets"
brew "erlang"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "go"
brew "grep"
brew "gum"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "jsonpp"
brew "krb5"
brew "lazygit"
brew "llvm@17"
brew "make"
brew "mongosh"
brew "neovim"
brew "openblas"
brew "oha"
brew "onefetch"
brew "openjdk"
brew "openvino"
brew "openvpn"
brew "oxker"
brew "php"
brew "pipx"
brew "qpdf"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "scrcpy"
brew "smartmontools"
brew "starship"
brew "terraform-local"
brew "tldr"
brew "trash-cli"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "zig"
brew "codecrafters-io/tap/codecrafters"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/yabai"
brew "localstack/tap/localstack-cli"
brew "oven-sh/bun/bun"
brew "railwayapp/tap/nixpacks"
brew "stripe/stripe-cli/stripe"
cask "alt-tab"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "anydesk"
cask "appcleaner"
cask "audacity"
cask "blender"
cask "brave-browser"
cask "bruno"
cask "caffeine"
cask "firefox"
cask "flameshot"
cask "flutter"
cask "folx"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "macs-fan-control"
cask "mongodb-compass"
cask "mono-mdk-for-visual-studio"
cask "neo4j"
cask "ngrok"
cask "numi"
cask "opera-gx"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "redisinsight"
cask "skype"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "telegram"
cask "temurin@8"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "webtorrent"
cask "whisky"
cask "zoom"
cask "zulu@17"
vscode "1yib.rust-bundle"
vscode "4ops.terraform"
vscode "alexcvzz.vscode-sqlite"
vscode "alexisvt.flutter-snippets"
vscode "amodio.tsl-problem-matcher"
vscode "artdiniz.quitcontrol-vscode"
vscode "ban.spellright"
vscode "bhoomitganatra.template-generators"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "burkeholland.simple-react-snippets"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hollowtree.vue-snippets"
vscode "hoovercj.haskell-linter"
vscode "jock.svg"
vscode "joshx.workspace-terminals"
vscode "justusadam.language-haskell"
vscode "mariusalchimavicius.json-to-ts"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "nomicfoundation.hardhat-solidity"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robertz.code-snapshot"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
